Autodesk.Revit.DB.GBXMLExportOptions.ExportAnalyticalSystems
Indicates if the gbXML should contain analytical system elements (e.g., Water Loop, Air System, and Zone Equipment).
Since:
2020.1

Autodesk.Revit.DB.GBXMLExportOptions.Encoding
The encoding options to go into the processing instruction for the exported gbXML file.
Since:
2020

Autodesk.Revit.DB.GBXMLExportOptions
Green-Building XML Export options.
Since:
2015